Repository: goatsweater/nrn-rrn
Catalog: docs/locale/*/LC_MESSAGES/data_product_specs.po
Languages: fr

source: The geometric accuracy of objects is given as the difference between objects position in the dataset and their real ground positions measured in reference to the geodetic network. The accuracy may vary from one object to another. It is thus provided in attribute with each feature occurrence and is expressed according to the Circular Map Accuracy Standard (CMAS).
fr: La précision géométrique des objets est représentée par la différence entre la position de ces objets dans le jeu de données et leurs positions réelles mesurées relativement au réseau géodésique. La précision peut varier d’un objet à un autre. Celle-ci est donc est fournie en attribut à chaque occurrence d’entité et est exprimée selon la Précision cartographique circulaire normalisée (PCCN).

source: Standard Circular Error:
fr: Erreur circulaire standard:

source: \sigma_c = 0.7071 (\sigma_x^2 + \sigma_y^2) \sigma_x : standard deviation in the X-axis \sigma_y : standard deviation in the Y-axis
fr: \sigma_c = 0.7071 (\sigma_x^2 + \sigma_y^2) \sigma_x : écart-type dans l’axe X \sigma_y : écart-type dans l’axe Y

source: CircularMapAccuracyStandard:
fr: Précision circulaire cartographique normalisée:

source: CMAS=2.1460 \sigma_c
fr: PCCN = 2.1460 \sigma_c

source: The planimetric accuracy aimed for the product is 10 meters or better. Under the data maintenance phase, no systematic validation of geometric and attributive accuracies is performed on all NRN datasets.
fr: La précision planimétrique visée est de 10 mètres ou mieux à un niveau de confiance de 90%. Dans le cadre de la maintenance des données, aucune validation systématique de la précision géométrique et attributive n’est effectuée sur l’ensemble des jeux de données RRN.

source: Data accuracy is evaluated according to the methods used to control acquisition sources (GPS, imagery, photogrammetry, etc.) and the positioning errors inherent to data extraction. The method for evaluating data accuracy is determined by the data provider.
fr: La précision des données est évaluée en fonction des méthodes utilisées pour contrôler les sources d’acquisition utilisées (GPS, imagerie, photogrammétrie, etc.) et des erreurs de positionnement liées à l’extraction des données. La méthode d’évaluation de la précision est déterminée par le fournisseur des données.

source: Relative internal positional accuracy
fr: Précision spatiale relative

source: Unknown
fr: Inconnue

source: Temporal accuracy
fr: Précision temporelle

source: Accuracy of a time measurement
fr: Précision d’une mesure de temps

source: Temporal consistency
fr: Cohérence temporelle

source: Temporal validity
fr: Validité temporelle

source: Thematic accuracy
fr: Exactitude thématique

source: Thematic classification correctness
fr: Exactitude de classification

source: Non quantitative attribute accuracy
fr: Exactitude des attributs non quantitatifs

source: The method used for evaluating the accuracy of the non quantitative attribute values with respect to reality is determined by each data provider.
fr: La méthode utilisée pour évaluer l’exactitude des attributs non quantitatifs par rapport à la réalité est déterminée par le fournisseur des données.

source: Quantitative attribute accuracy
fr: Précision des attributs quantitatifs

source: The method used for evaluating the accuracy of the quantitative attribute values with respect to reality is determined by each data provider.
fr: La méthode utilisée pour évaluer la précision des attributs quantitatifs par rapport à la réalité est déterminée par le fournisseur des données.

source: Data Capture
fr: Acquisition des données

source: The method used for data acquisition is determined by each data provider. The selected method must allow for the acquisition of quality geospatial data (current, accurate, consistent) for the entire dataset. Many acquisition sources are used: GPS, orthoimages, orthophotos, photogrammetry.
fr: Chaque fournisseur est libre d’utiliser la méthode d’acquisition de son choix. La méthode sélectionnée doit permettre d’obtenir des données géospatiales de qualité (précises, actuelles, cohérentes) pour l’ensemble du jeu de données. Plusieurs sources d’acquisition sont utilisées : GPS, ortho-images, ortho-photos, photogrammétrie.

source: Acquisition technique used by the provider is indicated in the object metadata associated with each entity occurrences.
fr: La technique d’acquisition utilisée par le fournisseur est décrite dans les métadonnées d’objet attribuées à chaque occurrence d’entité.

source: Data Maintenance
fr: Maintenance des données

source: Maintenance of the NRN data is done within the framework of intergovernmental partnership agreements (federal, provincial, territorial and municipal) by interested closest to source governmental bodies capable of offering adequate and current representations of the road phenomena. The minimal frequency of maintenance updates is of at least once a year.
fr: La maintenance des données RRN est effectuée par l’entremise d’ententes de partenariat intergouvernemental (fédéral, provincial, territorial et municipal) par les organismes gouvernementaux intéressés, identifiés être les plus près de la source et capables d’offrir des représentations adéquates et actualisées des phénomènes routiers. La fréquence de maintenance visée est d’au moins une mise à jour par an.

source: In order to help NRN data users in their management of the various update releases, updates are packaged and distributed by change effects (addition, retirement, modification, confirmation). By proceeding in this fashion, identification rules as well as methods for classifying the modifications are established.
fr: Afin d’aider les utilisateurs des données RRN dans leur gestion des mises à jour, ces dernières sont également distribuées selon les effets de mise à jour (ajout, destruction, modification, confirmation). Pour ce faire, des règles d’identification et des méthodes de classification des modifications ont été établies.

source: Identification rules on how to unequivocally identify entity occurrences are defined in the document entitled *National Vector Data – Identification Rules* available on the GeoBase portal (www.geobase.ca).
fr: Les règles d’identification ont pour but d’identifier de façon univoque chaque occurrence des entités et sont expliquées dans le document intitulé Données vectorielles nationales – Règles d’identification disponible sur le portail GéoBase (www.geobase.ca).

source: The methods for classifying updates by change effects (addition, retirement, modification and confirmation) are defined in the document *National Vector data – Change Management* available on the GeoBase portal (www.geobase.ca).
fr: Les méthodes utilisées pour déterminer les effets de mise à jour (ajout, destruction, modification et confirmation) sont décrites dans le document intitulé Données vectorielles nationales – Gestion des modifications disponible sur le portail GéoBase (www.geobase.ca).

source: Data Product Delivery
fr: Livraison du produit

source: Output file formats available for the product are: GML (*Geography Markup Language*), KML (*Keyhole Markup Language*) and SHAPE (ESRI |trade|).
fr: Les formats de fichiers de sortie disponibles pour le produit sont : GML (Geography Markup Language), KML (Keyhole Markup Language), SHAPE (ESRI |trade|) et GPKG (Geopackage).

source: Delivery format information on GML
fr: Information sur le format de livraison GML

source: Format name
fr: Nom du format

source: Languages used in the dataset according to ISO 639-2 standard:
fr: Langues utilisées dans le jeu de données selon la norme ISO 639-2 :

source: fra-French
fr: fra-français

source: Delivery format information on KML
fr: Information sur le format de livraison KML

source: KML specifications available on GoogleTM Earth web site (http://www.keyhole.com/kml/kml_doc.html).
fr: Spécifications du format KML disponibles (en anglais uniquement) sur le site de GoogleTM Earth (http://www.keyhole.com/kml/kml_doc.html).

source: Delivery format information on SHAPE
fr: Information sur le format de livraison SHAPE

source: Delivery format information on GPKG
fr: Information sur le format de livraison Geopackage

source: Delivery medium information
fr: Information sur le média de livraison

source: Units of delivery
fr: Unité de livraison

source: Canadian Province/Territory
fr: Province/Territoire canadien

source: Medium name
fr: Nom du média

source: Data are available on the GeoBase portal (www.geobase.ca).
fr: Les données sont disponibles via le portail GéoBase (www.geobase.ca).

source: Other delivery information
fr: Information additionnelle

source: The name of the files, entities and attributes are described in the document *National Road Network, edition 2.0.1, Product Distribution Formats* (www.geobase.ca).
fr: Le document Réseau routier national, édition 2.0.1, Formats de distribution du produit décrit le nom des fichiers, entités et attributs.

source: Data are subject to the GeoBase Unrestricted Use Licence Agreement (www.geobase.ca).
fr: L'utilisation des données est soumise aux conditions énoncées dans l'Accord de licence d'utilisation sans restriction de GéoBase (www.geobase.ca).

source: Metadata
fr: Métadonnées
