Repository: goatsweater/nrn-rrn
Catalog: docs/locale/*/LC_MESSAGES/distribution_formats.po
Languages: fr

source: Product Distribution Formats - Segmented View
fr: Formats de distribution du produit - Vue segmentée

source: Contents
fr: Contenu

source: Overview
fr: Aperçu

source: The following entities are part of the National Road Network (NRN) Segmented view: *Address Range*, *Alternate Name Link*, *Blocked Passage*, *Ferry Connection Segment*, *Junction*, *Crossing*, *Road Segment*, *Street and Place Names*, and *Toll Point*.
fr: Les entités du Réseau routier national (RRN) vue segmentée sont les suivantes: Intervalle d’adresse, Jonction, Lien nom non officiel, Noms de rue et de lieu, Passage obstrué, Poste de péage, Croisement, Segment de liaison par transbordeur et Segment routier.

source: The product is available in the following output file formats: GML (Geography Markup Language), KML (Keyhole Markup Language) SHAPE (ESRI |trade|).
fr: Les formats de fichiers de sortie disponibles pour le produit sont: GML (Geography Markup Language), KML (Keyhole Markup Language) et SHAPE (ESRI |trade|).

source: Data files distributed in KML format only contain the entity *Road Segment* and a subset of attributes.
fr: Les fichiers de données dans le format KML contiennent uniquement l’entité Segment routier et un sous-ensemble de ses attributs.

source: Product Identification
fr: Identification du produit

source: Name
fr: Nom

source: National Road Network
fr: Réseau routier national

source: Standard
fr: Normes

source: National Road Network: Data Product Specifications, Edition 2.1, 2012-03-31
fr: Réseau routier national : Spécifications de produit, édition 2.1, 2012-03-31

source: Feature catalogue
fr: Catalogue d’entités

source: National Road Network: Feature Catalogue, Edition 2.1, 2012-03-31
fr: Réseau routier national : Catalogue d’entités, édition 2.1, 2012-03-31

source: Distribution Formats Identification
fr: Identification des formats de distribution

source: July 1998
fr: Juillet 1998

source: January 2019
fr: Janvier 2019

source: Distribution Files Identification
fr: Identification des fichiers de distribution

source: GML File Names
fr: Nomenclature des fichiers GML

source: NRN entities distributed in GML format are grouped into separate dataset files. One file contains the geometrical entities and associated basic attributes, another file contains the addressing attributes tables, and finally up to four change management files (one for each type of content) are available. The name of a GML file is structured accordingly::
fr: Les entités du produit distribuées dans le format GML sont regroupées par jeu de données à l’intérieur de différents fichiers. Un fichier contenant les entités géométriques et leurs attributs de base (GEOM), un fichier regroupant les tables d’attributs d’adressage (ADDR), et jusqu’à quatre fichiers de gestion des modifications pour chaque type de contenu du jeu de données (GEOM et ADDR). Le nom des fichiers GML prend la forme suivante::

source: NRN = Abbreviated title of the product.
fr: RRN = Titre abrégé du produit.

source: <IDENTIFIER> = Code of a province or a territory corresponding to the dataset location. Possible codes are: AB, BC, MB, ON, NB, NL, NS, NT, NU, PE, QC, SK, YT.
fr: <IDENTIFIANT> = Code de province ou de territoire anglais correspondant à la localisation du jeu de données. Les codes possibles sont : AB, BC, MB, ON, NB, NL, NS, NT, NU, PE, QC, SK, YT.

source: <edition> = Dataset edition number.
fr: <édition> = Édition du jeu de données.

source: <version> = Dataset version number.
fr: <version> = Version du jeu de données.

source: <CONTENT> = Dataset content identifier. Possible values are: GEOM (Geometrical entities and basic attributes), ADDR (Address attributes tables).
fr: <CONTENU> = Indicateur du contenu du jeu de données. Les valeurs possibles sont : GEOM (entités géométriques et attributs de base), ADDR (tables d’attributs d’adressage).

source: [<MODIFICATION>] = [] = Optional. Type of modification applied to the dataset entities and attributes in comparison to previous edition. Possible values are identified in section 4.5.2.
fr: [<MODIFICATION>] = [] = Optionnel. Type de modification apportée aux entités et attributs du jeu de données par rapport à l’édition précédente. Les valeurs possibles sont identifiées à la section 4.5.2.

source: .gml = File name extension.
fr: .gml = Extension du nom de fichier.

source: Examples:
fr: Exemples:

source: ``NRN_AB_4_0_GEOM.gml`` (Geometrical entities and basic attributes of the dataset of Alberta, edition 4, version 0).
fr: ``RRN_AB_4_0_GEOM.gml`` (Entités géométriques et attributs de base du jeu de données de l’Alberta, édition 4, version 0).

source: ``NRN_AB_4_0_ADDR.gml`` (Tables of addressing attributes of the dataset of Alberta, edition 4, version 0).
fr: ``RRN_AB_4_0_ADDR.gml`` (Tables d’attributs d’adressage du jeu de données de l’Alberta, édition 4, version 0).

source: ``NRN_AB_4_0_GEOM_ADDED.gml`` (Geometrical entities and/or basic attributes added in the dataset of Alberta, edition 4, version 0).
fr: ``RRN_AB_4_0_GEOM_AJOUT.gml`` (Entités géométriques et/ou attributs de base ajoutés au jeu de données de l’Alberta, édition 4, version 0).

source: ``NRN_AB_4_0_ADDR_ADDED.gml`` (Tables of the addressing attributes added in the dataset of Alberta, edition 4, version 0).
fr: ``RRN_AB_4_0_ADDR_AJOUT.gml`` (Tables des attributs d’adressage ajoutés au jeu de données de l’Alberta, édition 4, version 0).

source: An XML schema (XSD file) is also provided along with a GML data file. This file defines, in a structured manner, the type of content, the syntax and the semantic of GML documents. The name of this file is ``NRN_<IDENTIFIER>_<edition>_<version>_<CONTENT>[_<MODIFICATION>].xsd`` and a reference is recorded within the GML file.
fr: Un schéma XML (fichier XSD) est également livré pour chaque fichier GML. Ce fichier définit de façon structurée le type de contenu, la syntaxe et la sémantique des documents GML. Le nom de ce fichier est RRN_<IDENTIFIANT>_<édition>_<version>_<CONTENU>[_<MODIFICATION>].xsd et est cité en référence dans le fichier GML.

source: KML file name
fr: Nomenclature du fichier KML

source: The entity Road Segment (and a subset of attributes) is the only entity part of the product that is distributed in KML format. The name of the KML file is structured accordingly::
fr: Uniquement l’entité Segment routier (et un sous-ensemble d’attributs) du produit est distribuée dans le format KML. Le nom du fichier KML prend la forme suivante::

source: nrn_rrn = Abbreviated English and French product title.
fr: nrn_rrn = Titre abrégé anglais et français du produit.

source: <identifier> = Code of a province or a territory corresponding to the dataset location. Possible codes are: ab, bc, mb, on, nb, nl, ns, nt, nu, pe, qc, sk, yt.
fr: <identifiant> = Code de province ou de territoire anglais correspondant à la localisation du jeu de données. Les codes possibles sont : ab, bc, mb, on, nb, nl, ns, nt, nu, pe, qc, sk, yt.

source: kml Dataset distribution format.
fr: kml Format de distribution du jeu de données.

source: en ISO code of the dataset distribution language.
fr: fr Code ISO de la langue de distribution du jeu de données.

source: .kmz = File name extension.
fr: .kmz = Extension du nom de fichier.

source: Example:
fr: Exemple:

source: ``nrn_rrn_ab_kml_en.kmz`` (Road Segment for dataset of Alberta).
fr: ``nrn_rrn_ab_4_0_kml_fr.kmz`` (Segment routier du jeu de données de l’Alberta, édition 4, version 0).

source: Shape file names
fr: Nomenclature des fichiers Shape

source: The entities of the product distributed in Shape format are divided according to their geometrical representation. The name of the Shape files is structured accordingly::
fr: Les entités du produit dans le format Shape sont divisées selon leur représentation géométrique. Le nom des fichiers Shape suit la structure suivante::

source: NRN = Abbreviated product title.
fr: RRN = Titre abrégé français du produit.

source: <ENTITY> = Abbreviated entity name as defined in section 4.5.1.
fr: <ENTITÉ> = Nom abrégé de l’entité tel que défini à la section 4.5.1.

source: .shp = Extension of the main geometry file name.
fr: .shp = Extension du nom de fichier principal de géométrie.

source: There are also five other files associated with the main geometry file of an entity in Shape format:
fr: Dans le format Shape, il y a également cinq autres types de fichiers associés au fichier de géométrie de l’entité:

source: an attribute file (.dbf for dBASE® file);
fr: un fichier d’attributs (.dbf pour dBASE |reg| file);

source: a projection file (.prj) which includes information about the reference system and the parameters of the cartographic projection;
fr: un fichier projection (.prj) contenant l’information sur le système de référence utilisé et les paramètres de la projection cartographique;

source: an index file (.shx) containing the offset (relative position) for each record of the main geometry file;
fr: un fichier d’index (.shx) contenant la position relative (offset) de chacun des enregistrements (records) du fichier principal de géométrie;

source: two spatial index files for the geometrical data (.sbn, .sbx).
fr: deux fichiers d’index spatial pour les données géométriques (.sbn, .sbx).

source: ``NRN_AB_4_0_ROADSEG.shp`` (Entity Road segment for dataset of Alberta, edition 4, version 0);
fr: ``RRN_AB_4_0_SEGMROUT.shp`` (Entité Segment routier du jeu de données de l’Alberta, édition 4, version 0);

source: ``NRN_AB_4_0_ROADSEG_ADDED.shp`` Road segment in dataset of Alberta, GPKG file names (Geometrical entities and/or basic attributes added to edition 4, version 0).
fr: ``RRN_AB_4_0_SEGMROUT_AJOUT.shp`` (Entités géométriques et/ou attributs de base du Segment routier ajoutés au jeu de données de l’Alberta, édition 4, version 0).

source: GeoPackage File Names
fr: Nomenclature des fichiers GPKG

source: The entities of the product distributed in GeoPackage format are distributed as a single file, with the entities divided into layers according to their geometrical representation. The name of the GeoPackage file is structured accordingly::
fr: Les entités du produit dans le format GPKG sont divisées selon leur représentation géométrique. Le nom des fichiers GPKG suit la structure suivante::

source: ``NRN_AB_4_0_ROADSEG.gpkg`` (All entities for dataset of Alberta, edition 4, version 0);
fr: ``RRN_AB_4_0_SEGMROUT.gpkg`` (Entité Segment routier du jeu de données de l’Alberta, édition 4, version 0);

source: Metadata File
fr: Fichier de métadonnées

source: There are four metadata files that are distributed with each dataset of an NRN product. Two files are provided in FGDC/XML format (in French and in English) and two others according to FGDC/HTML format. The name of the metadata file is structured accordingly::
fr: Quatre fichiers de métadonnées sont distribués avec chaque jeu de données du produit RRN. Deux fichiers sont livrés dans le format FGDC/XML (en français et en anglais) et deux autres selon le format FGDC/HTML. La nomenclature du fichier de métadonnées est::

source: fgdc = Metadata file format according to CSDGM standard of the Federal Geographic Data Committee (FGDC).
fr: fgdc = Format du fichier de métadonnées selon la norme CSDGM du Federal Geographic Data Committee.

source: <code language> = Metadata ISO code language written in lowercase: fr (French), en (English).
fr: <code langue> = Code ISO de la langue des métadonnées écrit en minuscules: fr (français), en (anglais).

source: <format> = File name extension (xml or html).
fr: <format> = Extension du nom de fichier (xml ou html).

source: ``nrn_rrn_ab_4_0_fgdc_en.xml`` (English metadata file for dataset of Alberta, edition 4, version 0 in FGDC/XML format)
fr: ``nrn_rrn_ab_4_0_fgdc_fr.xml`` (Fichier de métadonnées français du jeu de données de l’Alberta, édition 4, version 0 selon le format FGDC/XML)

source: List of distribution file names
fr: Liste des noms de fichiers de distribution

source: The NRN product is comprised of two types of datasets: a file that contains up to date (actualized) data (e.g. that has been updated) and a file containing the modifications (differences) applied to the previous edition of the dataset.
fr: Le produit RRN comporte deux types de jeux de données : des fichiers contenant les données actualisées (i.e. qui ont été mises à jour) et des fichiers contenant les modifications (différences) appliquées à l’édition précédente du jeu de données.

source: Dataset
fr: Jeu de données

source: The name of a file in GML format is NRN_<IDENTIFER>_<edition>_<version>_<CONTENT>. The name of a file in Shape format is NRN_<IDENTIFER>_<edition>_<version>_<ENTITY>. The extension of the file name corresponds to the distribution format.
fr: Le nom du fichier dans le format GML est RRN_<IDENTIFIANT>_<édition>_<version>_<CONTENU>. Le nom du fichier dans le format Shape est RRN_<IDENTIFIANT>_<édition>_<version>_<ENTITÉ>. L’extension du nom de fichier dépend directement du format de distribution.

source: Feature catalogue Entity name
fr: Catalogue d’entités Nom d’entité

source: GML/KML* Entity name
fr: GML/KML Nom d’entité

source: Shape File name (``<entity>``)
fr: Shape Nom du fichier (``<entity>``)

source: Type
fr: Type de géométrie

source: Address Range
fr: Intervalle d’adresse

source: AddressRange
fr: IntervalleAdresse

source: ADDRANGE
fr: INTERVADR

source: Alternate Name Link
fr: Lien nom non officiel

source: AlternateNameLink
fr: LienNomNonOfficiel

source: ALTNAMLINK
fr: LIENNOFF

source: Blocked Passage
fr: Passage obstrué

source: BlockedPassage
fr: PassageObstrue

source: BLKPASSAGE
fr: PASSAGEOBS

source: Ferry Connection Segment
fr: Segment de liaison par transbordeur

source: FerryConnectionSegment
fr: SegmentLiaisonTransbordeur

source: FERRYSEG
fr: SLIAISONTR

source: Line
fr: Ligne

source: Junction
fr: Jonction

source: JUNCTION
fr: JONCTION

source: Road Segment
fr: Segment routier

source: RoadSegment *
fr: SegmentRoutier *

source: ROADSEG
fr: SEGMROUT

source: Street and Place Names
fr: Noms de rue et de lieu

source: StreetPlaceNames
fr: NomRueLieu

source: STRPLANAME
fr: NOMRUELIEU

source: Toll Point
fr: Poste de péage

source: TollPoint
fr: PostePeage

source: TOLLPOINT
fr: POSTEPEAGE

source: \* KML content (simplified version of the dataset)
fr: \* Contenu KML (version simplifiée du jeu de données)

source: \** Attributes file (.dbf) in Shape format and entities without geometry in GML format.
fr: \** Fichier d’attributs (.dbf) dans le format Shape et entités sans géométrie dans le format GML.

source: Change Management Files
fr: Fichiers de gestion des modifications

source: Change management consists in identifying the effects of an addition, confirmation, retirement and modification of the objects (geometry and/or attribute) between two consecutive dataset editions. A data file is produced for each effect type. The name of the file in GML format is ``NRN_<IDENTIFIER>_<edition>_<version>_<CONTENT>_<MODIFICATION>`` and in Shape format is ``NRN_<IDENTIFIER>_<edition>_<version>_<ENTITY>_<MODIFICATION>``. The extension of the file name corresponds to the distribution format.
fr: La gestion des modifications consiste principalement à identifier l’ajout, la confirmation, l’élimination ou la modification des objets (géométrie et/ou attribut) entre deux éditions successives d’un jeu de données. Un fichier de données est généré pour chaque type d’effet. Le nom du fichier dans le format GML est ``RRN_<IDENTIFIANT>_<édition>_<version>_<CONTENU>_<MODIFICATION>``. Le nom du fichier selon le format Shape est ``RN_<IDENTIFIANT>_<édition>_<version>_<ENTITÉ>_MODIFICATION>``. L’extension du nom de fichier dépend directement du format de distribution.

source: Change management Effect name
fr: Gestion des modifications Nom de l’effet

source: GML File name (<MODIFICATION>)
fr: GML Nom du fichier (<MODIFICATION>)

source: Shape File name (<MODIFICATION>)
fr: Shape Nom du fichier (<MODIFICATION>)

source: Added
fr: Ajout

source: <GML File Name>_ADDED
fr: <Nom du fichier GML>_AJOUT

source: <Shape File Name>_ADDED
fr: <Nom du fichier Shape>_AJOUT

source: Confirmed
fr: Confirmation

source: <GML File Name>_CONFIRMED
fr: <Nom du fichier GML>_CONFIRME

source: <Shape File Name>_CONFIRMED
fr: <Nom du fichier Shape>_CONFIRME

source: Modified
fr: Modification

source: <GML File Name>_MODIFIED
fr: <Nom du fichier GML>_MODIFIE

source: <Shape File Name>_MODIFIED
fr: <Nom du fichier Shape>_MODIFIE

source: Retired
fr: Élimination

source: <GML File Name>_RETIRED
fr: <Nom du fichier GML>_ELIMINE

source: <Shape File Name>_RETIRED
fr: <Nom du fichier Shape>_ELIMINE

source: A readme text file named: ``README_<IDENTIFIER>.txt`` that identifies the method used for the *follow-up of the geometrical modifications* is provided with the dataset.
fr: La méthode utilisée pour le suivi des modifications géométriques est indiquée dans un fichier texte nommé : ``LISEZMOI_<IDENTIFIANT>.txt`` qui est joint au jeu de données.

source: Attributes Identification
fr: Identification des attributs

source: The attributes common to all entities of the NRN product are listed in the first table. The attributes specific to each entity are presented in the following subsection.
fr: Les attributs communs à l’ensemble des entités du produit RRN sont identifiés dans le premier tableau. Les attributs spécifiques à chaque entité sont présentés dans la sous-section suivante.

source: The data type for all distribution formats is either: C(c) for character or N(n,d) for number (c = number of characters, n = total number of digits, d = number of digits in decimal).
fr: Le type de données de tous les formats de distribution est soit : C(c) pour caractères ou N(n,d) pour nombre (c = nombre de caractères, n = nombre total de chiffres, d = nombre de chiffres en décimales).

source: Attributes Common to All Entities Except Alternate Name Link
fr: Attributs communs pour toutes les entités (sauf Lien nom non officiel)

source: Feature Catalogue Attribute Name
fr: Catalogue d’entités Nom d’attribut

source: GML Attribute Name
fr: GML Nom d’attribut

source: Shape Attribute Name
fr: Shape Nom d’attribut

source: Shape Data Type
fr: Type de données

source: Acquisition Technique
fr: Technique acquisition

source: acquisitionTechnique
fr: techniqueAcquisition

source: ACQTECH
fr: TECHACQ

source: Coverage
fr: Couverture

source: metadataCoverage
fr: couvertureMetadonnees

source: METACOVER
fr: COUVERMETA

source: Creation Date
fr: Date création

source: creationDate
fr: dateCreation

source: CREDATE
fr: DATECRE

source: Dataset Name
fr: Nom jeu de données

source: datasetName
fr: nomJeuDonnees

source: DATASETNAME
fr: NOMJEUDONN

source: Planimetric Accuracy
fr: Précision planimétrique

source: planimetricAccuracy
fr: precisionPlanimetrique

source: ACCURACY
fr: PRECISION

source: Provider
fr: Fournisseur

source: provider
fr: fournisseur

source: PROVIDER
fr: FOURNISSR

source: Revision Date
fr: Date révision

source: revisionDate
fr: dateRevision

source: REVDATE
fr: DATEREV

source: Standard Version
fr: Version normes

source: standardVersion
fr: versionNormes

source: SPECVERS
fr: VERSNORMES

source: Attributes Specific to Entities
fr: Attributs spécifiques aux entités

source: Alternate Street Name NID (left, right)
fr: IDN nom de rue non officiel (droite, gauche)

source: left_AlternateStreetNameNid
fr: idnNomRueNonOfficiel_Gauche

source: L_ALTNANID
fr: IDNOMNOF_G

source: right_AlternateStreetNameNid
fr: idnNomRueNonOfficiel_Droite

source: R_ALTNANID
fr: IDNOMNOF_D

source: Digitizing Direction Flag (left, right)
fr: Indicateur sens numérisation (droite, gauche)

source: left_DigitizingDirectionFlag
fr: sensNumerisation_Gauche

source: L_DIGDIRFG
fr: SENSNUM_G

source: right_DigitizingDirectionFlag
fr: sensNumerisation_Droite

source: R_DIGDIRFG
fr: SENSNUM_D

source: First House Number (left, right)
fr: Numéro première maison (droite, gauche)

source: left_FirstHouseNumber
fr: numPremiereMaison_Gauche

source: L_HNUMF
fr: NUMP_G

source: right_FirstHouseNumber
fr: numPremiereMaison_Droite

source: R_HNUMF
fr: NUMP_D

source: First House Number Suffix (left, right)
fr: Suffixe numéro première maison (droite, gauche)

source: left_FirstHouseNumberSuffix
fr: suffixNumPremiereMaison_Gauche

source: L_HNUMSUFF
fr: SUFNUMP_G

source: right_FirstHouseNumberSuffix
fr: suffixNumPremiereMaison_Droite

source: R_HNUMSUFF
fr: SUFNUMP_D

source: First House Number Type (left, right)
fr: Type numérotation première maison (droite, gauche)

source: left_FirstHouseNumberType
fr: typeNumPremiereMaison_Gauche

source: L_HNUMTYPE
fr: TYPENUMP_G

source: right_FirstHouseNumberType
fr: typeNumPremiereMaison_Droite

source: R_HNUMTYPE
fr: TYPENUMP_D

source: House Number Structure (left, right)
fr: Structure numéro maison (droite, gauche)

source: left_HouseNumberStructure
fr: structureNumMaison_Gauche

source: L_HNUMSTR
fr: STRUNUM_G

source: right_HouseNumberStructure
fr: structureNumMaison_Droite

source: R_HNUMSTR
fr: STRUNUM_D

source: Last House Number (left, right)
fr: Numéro dernière maison (droite, gauche)

source: left_LastHouseNumber
fr: numDerniereMaison_Gauche

source: L_HNUML
fr: NUMD_G

source: right_LastHouseNumber
fr: numDerniereMaison_Droite

source: R_HNUML
fr: NUMD_D

source: Last House Number Suffix (left, right)
fr: Suffixe numéro dernière maison (droite, gauche)

source: left_LastHouseNumberSuffix
fr: suffixNumDerniereMaison_Gauche

source: L_HNUMSUFL
fr: SUFNUMD_G

source: right_LastHouseNumberSuffix
fr: suffixNumDerniereMaison_Droite

source: R_HNUMSUFL
fr: SUFNUMD_D

source: Last House Number Type (left, right)
fr: Type numérotation dernière maison (droite, gauche)

source: left_LastHouseNumberType
fr: typeNumDerniereMaison_Gauche

source: L_HNUMTYPL
fr: TYPENUMD_G

source: right_LastHouseNumberType
fr: typeNumDerniereMaison_Droite

source: R_HNUMTYPL
fr: TYPENUMD_D

source: NID
fr: IDN

source: nid
fr: idn

source: Official Street Name NID (left, right)
fr: IDN nom de rue officiel (droite, gauche)

source: left_OfficialStreetNameNid
fr: idnNomRueOfficiel_Gauche

source: right_OfficialStreetNameNid
fr: idnNomRueOfficiel_Droite

source: Reference System Indicator (left, right)
fr: Indicateur système référence (droite, gauche)

source: left_ReferenceSystemIndicator
fr: indicSystemeReference_Gauche

source: rght_ReferenceSystemIndicator
fr: indicSystemeReference_Droite

source: DATASETNAM
fr: NOMJEUDONN

source: Street Name NID
fr: IDN nom de rue

source: streetNameNid
fr: idnNomRue

source: STRNAMENID
fr: IDNOMRUE

source: Blocked Passage Type
fr: Type passage obstrué

source: blockedPassageType
fr: typePassageObstrue

source: BLKPASSTY
fr: TYPEOBSTRU

source: Road Element NID
fr: IDN élément routier

source: roadElementNid
fr: idnElementRoutier

source: ROADNID
fr: IDNELEMRTE

source: Closing Period
fr: Période de fermeture

source: closingPeriod
fr: periodeFermeture

source: CLOSING
fr: FERMETURE

source: Ferry Segment ID
fr: ID segment liaison par transbordeur

source: ferrySegmentId
fr: idSegmentLiaisonTransbordeur

source: FERRYSEGID
fr: IDSEGMLTR

source: Functional Road Class
fr: Classification routière fonctionnelle

source: functionlaRoadClass
fr: classRoutiereFonctionnelle

source: ROADCLASS
fr: CLASSROUTE

source: Route Name English (1, 2, 3, 4)
fr: Nom de route anglais (1, 2, 3, 4)

source: routeNameEnglish1
fr: nomRouteAnglais1

source: RTENAME1EN
fr: NOMRTE1AN

source: routeNameEnglish2
fr: nomRouteAnglais2

source: RTENAME2EN
fr: NOMRTE2AN

source: routeNameEnglish3
fr: nomRouteAnglais3

source: RTENAME3EN
fr: NOMRTE3AN
