Repository: goatsweater/nrn-rrn
Catalog: docs/locale/*/LC_MESSAGES/distribution_formats.po
Languages: fr

source: routeNameEnglish4
fr: nomRouteAnglais4

source: RTENAME4EN
fr: NOMRTE4AN

source: Route Name French (1, 2, 3, 4)
fr: Nom de route français (1, 2, 3, 4)

source: routeNameFrench1
fr: nomRouteFrançais1

source: RTENAME1FR
fr: NOMRTE1FR

source: routeNameFrench2
fr: nomRouteFrançais2

source: RTENAME2FR
fr: NOMRTE2FR

source: routeNameFrench3
fr: nomRouteFrançais3

source: RTENAME3FR
fr: NOMRTE3FR

source: routeNameFrench4
fr: nomRouteFrançais4

source: RTENAME4FR
fr: NOMRTE4FR

source: Route Number (1, 2, 3, 4, 5)
fr: Numéro de route (1, 2, 3, 4, 5)

source: routeNumber1
fr: numeroRoute1

source: RTNUMBER1
fr: NUMROUTE1

source: routeNumber2
fr: numeroRoute2

source: RTNUMBER2
fr: NUMROUTE2

source: routeNumber3
fr: numeroRoute3

source: RTNUMBER3
fr: NUMROUTE3

source: routeNumber4
fr: numeroRoute4

source: RTNUMBER4
fr: NUMROUTE4

source: Exit Number
fr: Numéro de sortie

source: exitNumber
fr: numeroSortie

source: EXITNBR
fr: NUMSORTIE

source: Junction Type
fr: Type jonction

source: junctionType
fr: typeJonction

source: JUNCTYPE
fr: TYPEJONC

source: Address Range Digitizing Direction Flag (left, right)
fr: Indicateur sens numérisation adresse (droite, gauche)

source: left_AddressDirectionFlag *
fr: sensNumerisationAdresse_Gauche *

source: L_ADDDIRFG
fr: ADRSENS_G

source: right_AddressDirectionFlag *
fr: sensNumerisationAdresse_Droite *

source: R_ADDDIRFG
fr: ADRSENS_D

source: Address Range NID
fr: IDN intervalle d’adresse

source: addressRangeNid
fr: idnIntervalleAdresse

source: ADRANGENID
fr: IDINTERVAD

source: functionalRoadClass
fr: classRoutiereFonctionnelle

source: nid *
fr: idn *

source: Number Of Lanes
fr: Nombre de voies

source: numberLanes
fr: nombreVoies

source: NBRLANES
fr: NBRVOIES

source: Official Place Name (left, right)
fr: Nom de lieu officiel (droite, gauche)

source: left_OfficialPlaceName *
fr: nomLieuOfficiel_Gauche *

source: L_PLACENAM
fr: NOMLIEU_G

source: right_OfficialPlaceName *
fr: nomLieuOfficiel_Droite *

source: R_PLACENAM
fr: NOMLIEU_D

source: left_OfficialStreetNameConcat *
fr: idnNomRueOfficiel_Gauche *

source: L_STNAME_C
fr: NOMRUE_C_G

source: right_OfficialStreetNameConcat *
fr: idnNomRueOfficiel_Droite *

source: R_STNAME_C
fr: NOMRUE_C_D

source: Paved Road Surface Type
fr: Type de chaussée revêtue

source: pavedRoadSurfaceType
fr: typeChausseeRevetue

source: PAVSURF
fr: TYPEREV

source: Pavement Status
fr: État revêtement

source: pavementStatus
fr: etatRevetement

source: PAVSTATUS
fr: ETATREV

source: Road Jurisdiction
fr: Autorité route

source: roadJurisdiction
fr: autoriteRoute

source: ROADJURIS
fr: AUTORITE

source: Road Segment ID
fr: ID segment routier

source: roadSegmentId
fr: idSegmentRoutier

source: ROADSEGID
fr: IDSEGMRTE

source: Speed Restrictions
fr: Limites de vitesse

source: speedRestrictions
fr: limitesVitesse

source: SPEED
fr: VITESSE

source: Structure Name English
fr: Nom de structure anglais

source: structureNameEnglish
fr: nomStructureAnglais

source: STRUNAMEEN
fr: NOMSTRUCAN

source: Structure Name French
fr: Nom de structure français

source: structureNameFrench
fr: nomStructureFrançais

source: STRUNAMEFR
fr: NOMSTRUCAN

source: Structure ID
fr: ID structure

source: structureId
fr: idStructure

source: STRUCTID
fr: IDSTRUCT

source: Structure Type
fr: Type de structure

source: structureType
fr: typeStructure

source: STRUCTTYPE
fr: TYPESTRUCT

source: Traffic Direction
fr: Sens de circulation

source: trafficDirection
fr: sensCirculation

source: TRAFFICDIR
fr: SENSCIRCUL

source: Unpaved Road Surface Type
fr: Type de chaussée non revêtue

source: unpavedRoadSurfaceType
fr: typeChausseeNonRevetue

source: UNPAVSURF
fr: TYPENONREV

source: Directional Prefix
fr: Préfixe direction

source: directionalPrefix
fr: prefixeDirection

source: DIRPREFIX
fr: PREDIR

source: Directional Suffix
fr: Suffixe direction

source: directionalSuffix
fr: suffixeDirection

source: DIRSUFFIX
fr: SUFDIR

source: Place Name
fr: Nom de lieu

source: placeName
fr: nomLieu

source: PLACENAME
fr: NOMLIEU

source: Place Type
fr: Type de lieu

source: placeType
fr: typeLieu

source: PLACETYPE
fr: TYPELIEU

source: Street Name Article
fr: Article nom rue

source: streetNameArticle
fr: articleNomRue

source: STARTICLE
fr: ARTNOMRUE

source: Street Name Body
fr: Corps nom rue

source: streetNameBody
fr: corpsNomRue

source: NAMEBODY
fr: CORPSNOM

source: Street Type Prefix
fr: Préfixe type rue

source: streetTypePrefix
fr: prefixeTypeRue

source: STRTYPRE
fr: PRETYPRUE

source: Street Type Suffix
fr: Suffixe type rue

source: streetTypeSuffix
fr: suffixeTypeRue

source: STRTYSUF
fr: SUFTYPRUE

source: Toll Point Type
fr: Type poste péage

source: tollPointType
fr: typePostePeage

source: TOLLPTTYPE
fr: TYPEPTEPEA
