Repository: goatsweater/nrn-rrn
Catalog: docs/locale/*/LC_MESSAGES/nvd_identification_rules.po
Languages: fr

source: National Vector Data - Identification Rules
fr: Données vectorielles nationales - Règles d’identification

source: Contents
fr: Contenu

source: Abbreviations
fr: Sigles et abréviation

source: Identifier
fr: Identifiant

source: NHN
fr: RHN

source: NID
fr: IDN

source: National Identifier
fr: Identifiant national

source: NRCan
fr: RNCan

source: Natural Resources Canada
fr: Ressources naturelles Canada

source: NRN
fr: RRN

source: National Road Network
fr: Réseau routier national

source: NVD
fr: DVN

source: National Vector Data
fr: Données vectorielles nationales

source: UUID
fr: IDUU

source: Universal Unique Identifiers
fr: Identifiant universel unique

source: Terms and Definitons
fr: Termes et Définitions

source: Network Linear Element
fr: Données vectorielles nationales

source: Several layers of vector data, referred to as National Vector Data (NVD), will share the same specification. The National Road Network (NRN) and National Hydrographic Network (NHN) are examples of NVD.
fr: Plusieurs couches de données vectorielles partageront les mêmes spécifications. Ces couches sont appelées Données vectorielles nationales (DVN). Le réseau routier national (RRN) et le réseau hydrographique national (RHN) sont des exemples de DVN.

source: Overview
fr: Aperçu

source: The objective is to update the NVD product on a regular basis as soon as mechanisms have been established between NRN partners. One of the update mechanisms is by establishing change management principles. The establishment of change management principles is founded on two basic concepts: identification rules and definition / classification of change.
fr: L’objectif est d’actualiser les produits DVN sur une base régulière dès que des mécanismes auront été implantés parmi les partenaires de DVN. Un de ces mécanismes est la mise en œuvre de principes de gestion des modifications. Deux concepts de base sont nécessaires : règles d’identification et définition des classifications des modifications.

source: The concept of Identification is based on objects that depict real-world phenomena that vary over time, either by their description, by their precision or by the instruments and methods involved in their initial acquisition. It is therefore possible that more than one representation of the same phenomena may exist. To illustrate this fact, as part of this initiative, the goal is to build and maintain a **single** representation of the National Road Network. Identifiers play a fundamental role in ensuring long-term distributed data management and for implementing update mechanisms of Objects modified at the source and already provided to users. The implementation of a standard for the permanent identification of a phenomenon and its application must achieve two primary objectives:
fr: Quant à l’identification, les objets qui illustrent les phénomènes du monde réel varient avec le temps, soit par leur description, soit par la précision des instruments et méthodes utilisées pour leur acquisition initiale. Il est donc possible que plus d’une représentation des mêmes phénomènes existent. À titre d’exemple, dans le cadre de cette initiative, nous voulons élaborer et maintenir une seule représentation du réseau routier national. Les rôles des identifiants sont fondamentaux en vue d’assurer le bon échange et la bonne circulation des objets qui ont été modifiés à la source et qui ont déjà été livrés aux utilisateurs. L’implantation d’une norme pour l’identification permanente d’un phénomène et de son application vise deux objectifs primaires:

source: Facilitate the management and distribution of object changes in an incremental manner;
fr: faciliter la gestion et la distribution des modifications d'objets d'une manière progressive;

source: Facilitate the conflation process, if necessary.
fr: faciliter le processus de fusion, si nécessaire.

source: Every occurrence of NVD basic features must be uniquely identified: As an example, each geometric object in the NRN: *Road Element*, *Ferry Connection*, and *Junction* that describe specific characteristics of the linear network must also be uniquely identified.
fr: Chaque occurrence des entités fondamentales des DVN doit être identifiée de façon unique. Par exemple dans le RRN, chaque objet géométrique : élément routier, liaison par transbordeur et jonction, décrivant des caractéristiques spécifiques du réseau linéaire doivent également être identifiés de façon unique.

source: Identification Standard
fr: Norme d’identification

source: The Identifiers must be permanently assigned or persistent. To ensure their stability, the assigned IDs must be insignificant (inconsequential) in their expression [#f1]_. In other words, the IDs must not contain any information relative to the data. Past experience has demonstrated that encapsulating information within the ID can cause ID modification without any real change ever having occurred in the data.
fr: Les identifiants doivent être attribués d’une manière permanente. Pour assurer leur stabilité, les ID attribués doivent être insignifiants (sans conséquence) dans leur expression [#f1]_. En d’autres mots, les ID ne doivent pas contenir d’information relative aux données. Des expériences antérieures ont démontré qu’encapsuler de l’information dans les ID peut provoquer une modification des ID sans qu’aucun changement réel ne se produise dans les données.

source: Several standards have dealt with the Road Network. Most of them point to the importance of using Identifiers without ever specifying the manner, format, or method of application. GDF [#f2]_, GIS-T (GIS in transportation data standards) [#f3]_ and CEN TC 278 [#f4]_ documentation have no specifications related to Identifiers. National Spatial Data Infrastructure – USA (NSDI) Framework Transportation Identification Standard was the only document that clearly defined and described an Identifier code [#f5]_. However, within the ISO TC 211/SC: Geographic Information Standard - Encoding [#f6]_ the UUID definition did comply to the fundamental requirements sought after:
fr: Plusieurs normes ont traité la problématique du réseau routier. La plupart de celles-ci invoquent l’importance d’utiliser des identifiants sans ne jamais préciser d’aucune manière le format ou la méthode d’application. Les documents suivants, GDF [#f2]_, GIS-T (SIG en normes de données des transports) [#f3]_ et CEN TC 278 [#f4]_ ne comportent aucune spécification reliée aux identifiants. La norme National Spatial Data Infrastructure – USA (NSDI) Framework Transportation Identification Standard a été le seul document qui a clairement défini et expliqué un code d’identifiant [#f5]_. Dans la norme ISO TC 211/SC: Geographic Information Standard - Encoding [#f6]_, il y a une définition des IDUU qui correspond exactement aux exigences fondamentales recherchées:

source: “An application domain defines a universe and an identification scheme called universal unique identifiers (UUIDs). A UUID is assigned to an object when it is created and is stable over the object's entire life span. The UUID of a deleted object cannot be used again. UUIDs are required for long-term distributed data management and for implementing update mechanisms. These identifiers are also called persistent identifiers. A special name server may be used to resolve persistent identifiers. The identifiers are unique within a well-defined limited universe defined by an application domain.”
fr: Un domaine d’application définit un univers et un schéma d’identification appelés identifiants universels uniques (IDUU). Un IDUU est attribué à un objet quand il est créé et demeure stable pendant toute la durée de vie de l’objet. L’IDUU d’un objet supprimé ne peut pas être réutilisé. Les IDUU servent à faire la gestion à long terme de données distribuées et à réaliser des mécanismes d’actualisation. Ces identifiants sont également appelés identifiants persistants. Un serveur de noms spéciaux peut être utilisé pour résoudre les identifiants persistants. Les identifiants sont uniques à l’intérieur d’un univers limité bien défini caractérisé par un domaine d’application.

source: This ISO definition is thus adopted for the “Identifier”. A UUID generation mechanism is presented in the following section.
fr: Cette définition de l’ISO pour les identifiants a été adoptée. Le mécanisme de génération est présenté à la section suivante.

source: NVD Identification Standard
fr: Norme d’identification des DVN

source: ID uniqueness is one of the fundamental characteristics that must be maintained. Two techniques for making IDs unique were studied.
fr: Le caractère unique des ID est l’une des caractéristiques fondamentales qu’il faut maintenir. Deux techniques pour rendre les ID uniques ont été étudiées.

source: The first consists of mandating a firm to generate and manage ID ranges depending on data producers.
fr: La première consiste à mandater une entreprise de générer et de gérer les étendues des ID selon les producteurs de données.

source: The second consists of using a unique ID generation algorithm [#f7]_ that could be used by data producers with no particular management of range and domain.
fr: La seconde consiste à utiliser un algorithme [#f7]_ de génération d’ID unique dont pourraient se servir les producteurs de données sans gestion particulière de l’étendue ou du domaine.

source: The *second* method is best suited and was the one retained.
fr: C’est la *seconde* méthode qui a été retenue.

source: A UUID is an identifier that is unique across both space and time, with respect to the space of all UUIDs. UUID generation does not require a registration authority for each single identifier. Instead, it requires a unique value over space for each UUID generator. This spatially unique value is specified as an IEEE 802 address, which is usually already applied to network-connected systems. This 48-bit address can be assigned based on an address block obtained through the IEEE registration authority. This UUID specification assumes the availability of an IEEE 802 address.
fr: Un IDUU est un identifiant qui est unique dans le temps et l’espace, relativement à l’espace de tous les IDUU. La génération des IDUU ne demande pas une autorité d’enregistrement pour chacun des identifiants. Plutôt, l’identifiant demande une valeur unique pour l’espace pour chacun des générateurs d’IDUU. Cette valeur spatialement unique est spécifiée en tant qu’adresse IEEE 802, qui est normalement déjà appliquée aux systèmes reliés en réseau. Cette adresse de 48 bits peut être attribuée à partir d’un bloc d’adresses obtenu par l’entremise de l’autorité d’enregistrement IEEE. Cette spécification IDUU présume de la disponibilité d’une adresse IEEE 802.

source: The UUID consists of a 16-byte record and must void of padding between fields. The hexadecimal values “a” to “f” must be lower case. The total size is 128 bits. For use as human-readable text, a UUID string representation (32 characters) is specified as a sequence of fields. The following string is a UUID example:
fr: L’IDUU consiste en un enregistrement de 16 octets et ne doit pas contenir de remplissage entre les champs. Les valeurs hexadécimales « a » à « f » doivent être en minuscule. La taille totale est de 128 bits. Pour fin de lecture par des humains, une représentation de chaîne IDUU (32 caractères) est spécifiée comme une séquence de champs. La chaîne suivante est un exemple d’IDUU :

source: For more information: http://www.opengroup.org/onlinepubs/9629399/apdxa.htm#tagcjh_20
fr: Pour plus de renseignements : http://www.opengroup.org/onlinepubs/9629399/apdxa.htm#tagcjh_20

source: The assignation and persistence rules of the UUID are further explained in the :doc:`nvd_change_management` document.
fr: Les règles d’attribution et de persistance relativement aux IDUU sont expliquées dans le document :doc:`nvd_change_management`.

source: NID Values
fr: Valeurs IDN

source: The algorithm described in the previous section provides producers the needed flexibility while working within a network of partners. The algorithm can be used by all closest to source data producers to modify the data and add a new NID when needed. **NIDs should only be generated and assigned by authorized organizations**. Specific care must be given to the management of NIDs. These NIDs will eventually allow for data synchronization between organizations. Data users must ensure that they make **no alterations whatsoever to these** NIDs value in order to ensure synchronization. Modifications to NID’s would render them useless for data synchronization.
fr: L’algorithme abordé au paragraphe précédent permet de la souplesse pour travailler avec plusieurs partenaires. Cet algorithme bien connu pourrait être utilisé par n’importe quel utilisateur de données pour modifier les données et y ajouter un nouvel IDN. Les IDN doivent être générés seulement par des organismes autorisés. Un soin particulier doit être accordé aux IDN. Ces IDN permettront éventuellement la synchronisation des données parmi des organismes. Les utilisateurs de données doivent s’assurer de ne pas modifier d’aucune manière ces valeurs IDN. Sinon, l’utilisation des IDN pour fin de synchronisation sera inutile.

source: Footnotes
fr: Références

source: Bédard Y, Larrivé S et Proulx M-J. “Travaux de modélisation pour la mise en place de la base de données géospatiale“ ISIS, Laval University, March 2000
fr: Bédard, Y., Larrivé, S. et Proulx, M.-J. Travaux de modélisation pour la mise en place de la base de données géospatiale ISIS, Université Laval, mars 2000.

source: ISO Technical Committee 204, Working group 3, “ISO/TR 14825 GDF – Geographic Data Files – Version 4.0,” ISO/TC 204 N629, October 12, 2000
fr: ISO Technical Committee 204, Working Group 3. ISO/TR 14825 GDF – Geographic Data Files – Version 4.0, ISO/TC 204 N629, 12 octobre 2000.

source: Dueker, Kenneth J. and Butler, J. Allison, “GIS-T Enterprise Data Model with Suggested Implementation Choices“,Center for Urban Studies School of Urban and Public Affairs Portland State University, October 1, 1997
fr: Dueker, Kenneth J. et Butler, J. Allison. GIS-T Enterprise Data Model with Suggested Implementation Choices, Center for Urban Studies, School of Urban and Public Affairs, Portland State University, 1er octobre 1997.

source: National Spatial Data Infrastructure, “NSDI FRAMEWORK TRANSPORTATION IDENTIFICATION STANDARD -- Public Review Draft,” FGDC-STD-999.1-2000, Ground Transportation Subcommittee Federal Geographic Data Committee, December, 2000
fr: National Spatial Data Infrastructure. NSDI FRAMEWORK TRANSPORTATION IDENTIFICATION STANDARD -- Public Review Draft, FGDC-STD-999.1-2000, Ground Transportation Subcommittee, Federal Geographic Data Committee, décembre 2000.

source: ISO Technical Committee 211, Working Group 4, “Geographic Information – Encoding,” ISO/CD 19118.3, June 15, 2001
fr: ISO Technical Committee 211, Working Group 4. Geographic Information – Encoding, ISO/CD 19118.3, 15 juin 2001.

source: Readers wishing to use a standards-body definition of UUIDs/GUIDs should refer to: ISO/IEC 11578:1996 Information technology -- Open Systems Interconnection -- Remote Procedure Call http://www.iso.org/iso/en/CatalogueDetailPage.CatalogueDetail?CSNUMBER=2229&ICS1=35&ICS2=100&ICS3=70 or DCE 1.1: Remote Procedure Call Open Group Technical Standard Document Number C706, August 1997, 737 pages. (Supersedes C309 DCE: Remote Procedure Call 8/94, which was the basis for the ISO specification) http://www.opengroup.org/publications/catalog/c706.htm
fr: Si vous désirez consulter une définition officielle de IDUU/GUID, nous vous encourageons à aller à : ISO/IEC 11578:1996 Technologies de l'information -- Interconnexion de systèmes ouverts (OSI) -- Appel de procédures à distance (RPC) : http://www.iso.org/iso/fr/CatalogueDetailPage.CatalogueDetail?CSNUMBER=2229&ICS1=35&ICS2= 100&ICS3=70; ou à : DCE 1.1: Remote Procedure Call Open Group Technical Standard Document Number C706, août 1997, 737 pages. (Ce document remplace C309 DCE: Remote Procedure Call 8/94 qui a servi de base pour la spécification ISO) : http://www.opengroup.org/publications/catalog/c706.htm
