Repository: goatsweater/nrn-rrn
Catalog: docs/locale/*/LC_MESSAGES/nvd_change_management.po
Languages: fr

source: Change Management
fr: Gestion des modifications

source: Contents
fr: Contenu

source: Abbreviations
fr: Sigles et abréviations

source: Identifier
fr: Identifiant

source: NID
fr: IDN

source: National Identifier
fr: Identifiant national

source: NHN
fr: RHN

source: National Hydrographic Network
fr: Réseau hydrographique national

source: NRCan
fr: RNCan

source: Natural Resources Canada
fr: Ressources naturelles Canada

source: NRN
fr: RRN

source: National Road Network
fr: Réseau routier national

source: NVD
fr: DVN

source: National Vector Data
fr: Données vectorielles nationales

source: UUID
fr: IDUU

source: Universal Unique Identifiers
fr: Identifiant universel unique

source: Terms and Definitions
fr: Termes et définitions

source: Several layers of vector data, referred to as National Vector Data (NVD), will share the same specification. The National Road Network (NRN) and National Hydrographic Network (NHN) are examples of NVD.
fr: Plusieurs couches de données vectorielles partageront les mêmes spécifications. Ces couches sont appelées Données vectorielles nationales (DVN). Le Réseau routier national (RRN) et le Réseau hydrographique national (RHN) sont des exemples de DVN.

source: Overview
fr: Aperçu

source: The objective is to update the NVD data on a regular basis as soon as mechanisms have been established between NVD’s partners. One of the mechanisms is establishing change management principles. Two basic concepts are needed: identification rules and definition / classification of change.
fr: L’objectif est d’actualiser les produits DVN sur une base régulière dès que des mécanismes auront été implantés parmi les partenaires des DVN. Un de ces mécanismes est la mise en œuvre de principes de gestion des modifications. Deux concepts de base sont nécessaires : règles d’identification et définition des classifications des modifications.

source: :doc:`nvd_identification_rules` defines the identification mechanism used as precisely as possible. In terms of change management, the NVD doesn't attempt to track the evolution of phenomena in the real world (features), but rather of the objects that represent them. In other words, the NVD does not monitor real changes in the territory; they identify only the *effects* they have on the data.
fr: Le document Données vectorielles nationaesl – Règles d’identification1 définit aussi précisément que possible le mécanisme d’identification utilisé. Du côté de la gestion des modifications, les DVN ne tente pas de suivre l’évolution des phénomènes du monde réel (entités), mais essaient plutôt de maintenir une certaine évolution des objets qui les représentent. En d’autres mots, les DVN ne fera pas le suivi des changements réels dans le territoire, ils identifient seulement les *effets* que ceux-ci ont sur les données.

source: Many projects (or the literature) deal with update management and time modelling [#f1]_, [#f2]_, [#f3]_. The model herein was developed in cooperation with the Centre for Research in Geomatics (CRG) at Laval University [#f4]_.
fr: Plusieurs projets (ou leur documentation) traitent de la gestion des mises à jour et de la modélisation temporelle [#f1]_, [#f2]_, [#f3]_. Le modèle dans ce document a été mis au point en collaboration avec le Centre de recherche en géomatique (CRG) de l’Université Laval [#f4]_.

source: It is aimed to monitor the evolution of objects in order to identify any changes that may have occurred between two observations, whether successive or not. The discrepancies observed between two observations are referred to as the differential [#f5]_. Change management also makes it possible to track updates as well as data corrections. The purpose of update management is to facilitate synchronization of databases from producing partners and customers based on current national views (see Figure 1 : Evolution of the database in time).
fr: Il est visé de suivre l’évolution des objets dans le but de relever tout changement qui peut s’être produit entre deux observations, successives ou non. Les différences notées entre deux observations constituent ce qu’on appelle l’écart2. La gestion des modifications permet également de relever les mises à jour et les corrections apportées aux données. Le but de la gestion des modifications est de faciliter la synchronisation des bases de données provenant de partenaires producteurs et de clients selon les normes nationales en vigueur (voir la figure 1 : Évolution de la base de données en temps).

source: The update management process must also make it possible to reconstitute the data as it was on a previous date.
fr: Le processus de gestion des mises à jour doit aussi permettre la reconstitution des données comme elles existaient à une date antérieure.

source: Figure 1: Evolution of the database in time.
fr: Figure 1 : Évolution de la base de données en temps

source: Object Life Cycle
fr: Cycle de vie de l’objet

source: NVD data constitutes the best representation of the real-world phenomena of interest, unless proven otherwise. The geometric data in the NVD must undergo a minimum of change. Changes occur when a new information source offers a better representation than the preceding one.
fr: Les DVN constituent la meilleure représentation des phénomènes d’intérêt du monde réel jusqu’à preuve du contraire. Les données géométriques dans les DVN ne doivent subir qu’un minimum de changement. Les changements ont lieu quand une nouvelle source d’information offre une meilleure représentation que la précédente.

source: The effects on NVD data will therefore be established based on the preceding representation. Data life cycle is therefore limited by two events. The cycle always begins with an "addition" (assignment of a new NID) and ends with "retirement." Between these two events, geometric or descriptive modification or confirmation of the preceding state can occur, while maintaining the same NID. Data with the effects "addition," "geometric or descriptive modification," and "confirmation" are *active* (or current) features. Features with the effect "retirement" are *nonactive* (historical) data.
fr: Les effets sur les données DVN seront établis en fonction de la représentation précédente. Le cycle de vie des données est limité par deux événements. Le cycle débute toujours par un « ajout » (attribution d’un nouvel IDN) et se termine par « élimination ». Entre ces deux événements, la modification géométrique ou descriptive, ou encore la confirmation de l’état précédent, peut se produire, tout en conservant le même IDN. Les données ayant les effets « ajout », « modification géométrique ou descriptive » et « confirmation » sont des entités dites *actives* (ou actuelles). Les entités ayant l’effet « élimination » sont des données dites *non actives* (historiques).

source: Effect Types
fr: Types d’effets

source: Updating makes it possible to establish a parallel between existing data and the new data from an update. The latter has certain effects on the data. The following effects can be classified as:
fr: L’actualisation permet d’établir un parallèle entre les données existantes et les nouvelles données provenant d’une mise à jour. Ces dernières produisent certains effets sur les données. Les effets suivants peuvent être classés comme:

source: Additon (Existence)
fr: Ajout (Existence)

source: When a new object has no geometric counterpart in the NVD, a new object is *added*, along with a new NID.
fr: Quand un nouvel objet n’a pas son équivalent dans les DVN, un nouvel objet est *ajouté* avec un nouvel IDN.

source: Retirement (Existence)
fr: Élimination (Existence)

source: When an object no longer represents a feature, the object is *retired*. This type of object i s removed from the current data while maintaining its NID.
fr: Quand un objet ne représente plus une entité, il est éliminé. Ce type d’objet est éliminé des données courantes en gardant son IDN.

source: An object is said to be *modified* if one of its descriptive attributes or its geometric representation is different. In this case, the initial NID is preserved for the new version of the object. Two types of modification are possible.
fr: Un objet est dit modifié si l’un de ses attributs descriptifs ou sa représentation géométrique est différent. Le cas échéant, l’IDN initial est préservé pour la nouvelle version de l’objet. Deux types de modification sont possibles.

source: Descriptive Modification
fr: Modification descriptive

source: A descriptive modification occurs when a pair of objects from the same class is geometrically identical but has different attribute values. For example, the type of surface of a specific road may have changed from «unpaved» to «paved».
fr: Une modification descriptive se produit quand une paire d’objets provenant de la même classe sont géométriquement identiques mais ont des valeurs attributives différentes. Par exemple, le type de surface d’une route spécifique peut avoir changé de «sans revêtement» à «avec revêtement».

source: Geometric Modification
fr: Modification géométrique

source: A geometric modification occurs when a pair of objects from the same class has different geometries that describe the same phenomena.
fr: Une modification géométrique se produit quand une paire d’objets provenant de la même classe ont des géométries distinctes qui décrivent les mêmes phénomènes.

source: There are three types of geometric modification currently defined within the NVD. Each has a certain level of complexity. In comparing two representations (old and new), it is possible to define geometric modifications as being:
fr: Trois types de modification géométrique sont actuellement définis à l’intérieur des DVN. Chacun de ces types comporte un certain niveau de complexité. En comparant deux représentations (ancienne et nouvelle), on peut définir les modifications géométriques comme étant:

source: First Method
fr: Première méthode

source: While comparing two objects, if one vertex is different from its previous representation, the old representation is retired and a new representation added. This method of managing representation modifications means that geometric modifications are not followed.
fr: En comparant deux objets, si un sommet est différent de sa représentation précédente, l’ancienne représentation est éliminée et une nouvelle est ajoutée avec un nouvel IDN. Cette méthode de gérer les modifications de représentation signifie que les modifications géométriques ne sont pas suivies.

source: Second method
fr: Deuxième méthode

source: The second method of managing representation change is based on comparing the old and the new Junction locations. Two Junctions always bound a Network Linear Element. Any modification along an element (geometric representation) may occur between its Junctions. These are treated as a geometric modification while conserving its NID. If, for whatever reason, one of the old Junctions located at one end of the Network Linear Element has changed, then this Network Linear Element is retired and a new one added.
fr: Cette méthode de gérer les changements de représentation consiste à comparer les emplacements des anciennes et nouvelles Jonctions. Deux Jonctions limitent toujours un Élément Linéaire de réseau. Toute modification le long d’un Élément Linéaire (représentation géométrique) peut se produire entre ses Jonctions. Cela est traité comme une modification géométrique tout en conservant son IDN. Cependant, quelle qu’en soit la raison, si une des anciennes Jonctions situées à une extrémité de l’Élément Linéaire de réseau a changé, cet Élément Linéaire de réseau est alors éliminé et un nouvel Élément Linéaire est ajouté.

source: Third method
fr: Troisième méthode

source: The third method is based on topological links. If the representation of the Linear Element Junctions have maintained the same topological links (even if the Junctions have moved and the Network Linear Element geometry has been modified), then these changes are treated as a geometric modifications and the Network Linear Element and Junctions maintain their NIDs.
fr: Cette méthode est fondée sur des liens topologiques. Si la représentation des Jonctions d’Éléments Linéaires conserve les mêmes liens topologiques (même si les Jonctions ont changé de place et que la géométrie de l’Élément Linéaire de réseau a été modifiée), ce changement est alors traité comme une modification géométrique et l’Élément Linéaire de réseau ainsi que les Jonctions conservent tous leurs IDN.

source: Alongside change, there is confirmation of objects when the geometric or descriptive attributes have not been modified.
fr: Conjointement avec le changement, il y a confirmation des objets quand les attributs géométriques et descriptifs n’ont pas été modifiés.

source: Used Effects
fr: Effets utilisés

source: Segmented Data
fr: Données segmentées

source: Feature classes with geometry track change using all *effects* defined in Section 3 (Addition, Descriptive Modification, Retirement and Confirmation).
fr: La gestion des modifications sur les données segmentées est faite à l’aide des effets définis à la section 3 (Ajout, Élimination, Modification descriptive et Confirmation).

source: In the segmented model, the effect must be associated to the complete Network Linear Element even if this one is broken up into several segments because of a change of attribute. I.e. the same effect must be applied to all the segments that have the same value of attribute NID. The segments that describe the same Network Linear Element can have only one effect and the set of priorities is as follows: Addition, Descriptive Modification and Confirmation.
fr: Dans le modèle segmenté, l'effet doit être associé à l’Élément Linéaire au complet même si celui-ci est décomposé en plusieurs segments à cause d’un changement d’attribut. C’est-à-dire qu’un même effet doit être utilisé pour l'ensemble des segments qui ont la même valeur d’attribut IDN. Les segments qui décrivent un même Élément Linéaire peuvent avoir un seul effet et l'ordre de priorité est le suivant : Ajout, Modification descriptive et Confirmation.

source: The follow-up method for geometric modifications is indicated by the change management provider.
fr: La méthode de suivi utilisée pour les modifications géométriques est indiquée par le fournisseur des gestions des modifications.

source: Example
fr: Exemple

source: Figure 2: Example of an update.
fr: Figure 2 : Exemple d’une mise à jour

source: Table 1: Updating effects shows the geometric effects observed after the update.
fr: Le Tableau 1 : Mise à jour des effets, illustre les effets observés à la suite de la mise à jour.

source: Objects
fr: Objet

source: Explanation
fr: Explication

source: Effects
fr: Effet

source: No correspondence with a new object.
fr: Aucune correspondance avec un nouvel objet.

source: Retirement
fr: Élimination

source: No correspondence with an object in the original data; the arrival of object 6 changed the topological structure of the objects (and therefore the geometry).
fr: Aucune correspondance avec un objet dans les données d’origine; l’arrivée de l’objet 6 a modifié la structure topologique des objets (et par conséquent, la géométrie).

source: Addition
fr: Ajout

source: No correspondence with an object in the original data.
fr: Aucune correspondance avec un objet dans les données d’origine; l’entité n’était pas représentée.

source: Attribute value changed.
fr: Valeur d’attribut modifiée.

source: Description modification
fr: Modification descriptive

source: Geometry and attributes did not change.
fr: La géométrie et les attributs n’ont pas été modifiés.

source: Table 1: Updating effects.
fr: Tableau 1 : Mise à jour des effets

source: Footnotes
fr: Références

source: Worboys, Michael F. A Unified Model for Spatial and Temporal Information, The Computer Journal, Vol 37, No. 1, pp. 26-34
fr: Worboys, Michael F. A Unified Model for Spatial and Temporal Information, The Computer Journal, vol. 37, no 1, p. 26-34.

source: Pouliot, J, Larrivé, S., and Bédard, Y. Typologie des mises à jour, 2000, 11 p.
fr: Pouliot, J, Larrivé, S. et Bédard, Y. Typologie des mises à jour, 2000, 11 p.

source: The differential corresponds to the set of differences observed between two landmarks of the territory [#f4]_.
fr: L’écart correspond à l’ensemble des différences notées entre deux repères du territoire [#f4]_.
